app/views/ticket_types/index.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "ticket_zones".* FROM "ticket_zones" WHERE "ticket_zones"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= Event.find(ticket_type.event_id)[:name] %></td>
      <td><%= ticket_type.price %></td>
      <td><%= TicketZone.find(ticket_type.ticket_zone_id)[:zone] %></td>