app/views/ticket_types/new.html.erb

		<%= form.label :event_id %><br>
		<%= form.collection_select(:event_id, Event.all, :id, :name)%>
---
SELECT "events".* FROM "events"

		<%= form.label :ticket_zone_id %><br>
		<%= form.collection_select(:ticket_zone_id, TicketZone.all, :id, :zone) %>
---
SELECT "ticket_zones".* FROM "ticket_zones"