app/views/users/index.html.erb


  <% for user in User.all %>
---
SELECT "users".* FROM "users"