app/views/users/user_with_most_tickets.html.erb


<% for order in Order.all %>
      <% for ticket in Ticket.all %>
---
SELECT "orders".* FROM "orders"
SELECT "tickets".* FROM "tickets"