app/views/events/edit.html.erb

SELECT "event_venues".* FROM "event_venues"
---
    <%= form.label :EventVenue %><br>
    <%= form.collection_select(:event_venue_id, EventVenue.all, :id, :name)%>