app/views/events/new.html.erb

    <%= form.label :EventVenue %><br>
    <%= form.collection_select(:event_venue_id, EventVenue.all, :id, :name) %>
---
SELECT "event_venues".* FROM "event_venues"