app/views/events/show.html.erb

  <strong>EventVenue:</strong>
  <%= EventVenue.find(@event.event_venue_id)[:name] %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]