app/views/events/upcoming_events.html.erb

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td><%= event.description %></td>
      <td><%= EventVenue.find(event.event_venue_id)[:name] %></td>