app/views/tickets/edit.html.erb

		<%= form.label :ticket_type_id %><br>
		<%= form.collection_select(:ticket_type_id, TicketType.all, :id, :id) %>
---
SELECT "ticket_types".* FROM "ticket_types"

		<%= form.label :order_id %><br>
		<%= form.collection_select(:order_id, Order.all, :id, :id) %>
---
SELECT "orders".* FROM "orders"