app/controllers/events_controller.rb

	def create
		@event = Event.new(event_params)
		respond_to do |format|
      		if @event.save
---
INSERT INTO "events" ("name", "description", "start_date", "event_venue_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdasdasd"], ["description", ""], ["start_date", "2019-04-11"], ["event_venue_id", 1], ["created_at", "2019-04-11 22:11:31.810126"], ["updated_at", "2019-04-11 22:11:31.810126"]]

	def update

		@event = Event.find(params[:id])
		respond_to do |format|
	    	if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start_date", "2019-11-21"], ["updated_at", "2019-04-11 22:12:55.049605"], ["id", 6]]

	def upcoming_events
		list = []
		for e in Event.all do
---
SELECT "events".* FROM "events"