app/controllers/event_venues_controller.rb

SELECT "event_venues".* FROM "event_venues"
---
  def index
  	@event_venues = EventVenue.all

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@event_venue = EventVenue.find(params[:id])

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def edit
  	@event_venue = EventVenue.find(params[:id])

INSERT INTO "event_venues" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["address", ""], ["created_at", "2019-04-11 22:21:49.695828"], ["updated_at", "2019-04-11 22:21:49.695828"]]
---
  def create
  	@event_venue = EventVenue.new(event_venue_params)

  	if @event_venue.save

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "event_venues" SET "name" = ?, "capacity" = ?, "updated_at" = ? WHERE "event_venues"."id" = ?  [["name", "ddafda-edit"], ["capacity", 2000], ["updated_at", "2019-04-11 04:18:17.325282"], ["id", 8]]
---
  def update
  	@event_venue = EventVenue.find(params[:id])

  	if @event_venue.update(event_venue_params)

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "event_venues" WHERE "event_venues"."id" = ?  [["id", 4]]
---
  def destroy
  	@event_venue = EventVenue.find(params[:id])
  	@event_venue.destroy