app/controllers/ticket_types_controller.rb

SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def destroy
  		@ticket_type = TicketType.find(params[:id])