app/controllers/ticket_types_controller.rb

	def index
		@ticket_types = TicketType.all
---
SELECT "ticket_types".* FROM "ticket_types"

	def show
		@ticket_type = TicketType.find(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@ticket_type = TicketType.find(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update

		@ticket_type = TicketType.find(params[:id])
		respond_to do |format|
	    	if @ticket_type.update(ticket_type_params)
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "ticket_types" SET "price" = ?, "updated_at" = ? WHERE "ticket_types"."id" = ?  [["price", 3], ["updated_at", "2019-04-11 15:39:46.346418"], ["id", 8]]

	def destroy
  		@ticket_type = Ticket.find(params[:id])
  		@ticket_type.destroy
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "ticket_types" WHERE "ticket_types"."id" = ?  [["id", 8]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 8]]