app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
SELECT "tickets".* FROM "tickets" WHERE "tickets"."ticket_type_id" = ?  [["ticket_type_id", 1]]
---
	def index

		if params[:ticket_type_id].blank?
			@tickets = Ticket.all
		else
			@tickets = Ticket.where(ticket_type_id: params[:ticket_type_id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show

		@ticket = Ticket.find(params[:id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("ticket_type_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ticket_type_id", 1], ["order_id", 1], ["created_at", "2019-04-11 22:15:31.356436"], ["updated_at", "2019-04-11 22:15:31.356436"]]
---
	def create
		@ticket = Ticket.new(ticket_params)
		respond_to do |format|
      		if @ticket.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def update

		@ticket = Ticket.find(params[:id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 14]]
---
	def destroy
  		@ticket = Ticket.find(params[:id])
  		@ticket.destroy