app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		respond_to do |format|
      		if @user.save
---
INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["lastname", ""], ["email", ""], ["password", ""], ["address", ""], ["created_at", "2019-04-11 22:09:01.746658"], ["updated_at", "2019-04-11 22:09:01.746658"]]

	def update
		@user = User.find(params[:id])
		respond_to do |format|
	    	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", ""], ["updated_at", "2019-04-11 22:09:19.524786"], ["id", 1]]

  	def user_with_most_tickets
  		max = 0
  		for u in User.all do
  			contador = 0
  			for o in Order.all do
  				if o[:user_id] == u[:id]
  					for t in Ticket.all do
---
SELECT "users".* FROM "users"
SELECT "orders".* FROM "orders"
SELECT "tickets".* FROM "tickets"